[
    {
      "id": "atlas",
      "name": "Atlas File Manager",
      "description": "A Highly Customizable Cross-Platform File Manager utilizing keyboard shortcuts managing files with the complexity and using it with the simplicities. ",
      "date": "2023-08-01",
      "tools": ["Rust", "Tauri", "Svelte", "Node.js"],
      "preview": "https://your-portfolio-preview-link.com",
      "source": "https://github.com/username/portfolio-website",
      "image": "",
      "challenges": [
        "Create a simple user interface for searching for files in the existing machine that returns data as quickly as possible without hardware limitations.",
        "Secure application from XSS (Cross-site scripting) and external access."
      ],
      "solutions": [
        "Optimizing File Search by implementing efficient searching algorithms, combining Binary Search and Quick sort to establish an efficient return.",
        "Use Tauri's Permissions to prevents access from outside the application and sanitize data on crucial elements."
      ],
      "outcome": "The application successfully allows the user to browse the existing state of the file system with permissions with simple functions of a file manager being implemented using CRUD, and applied optimizations for quick data retrievals providing the availability for use on limiting hardware."
    },
    {
      "id": "kucss",
      "name": "Kingston University Cyber Security Society Website",
      "description": "The Website for Kington University Cyber Security Society filled with information for upcoming events, online course recommendations and projects students can follow to learn, adapt and grow.",
      "date": "2024-10-07",
      "tools": ["Svelte", "Tailwind", "Node.js"],
      "preview": "https://kucss.uk",
      "source": "https://github.com/Nash-ken/KUCS",
      "image": "",
      "challenges": [
        "Fetch and Display upcoming events using JSON files without rebuilding the site everytime the file is updated.",
        "Creste a Responsive Layout that makes it accessible for mobile devices."
      ],
      "solutions": [
        "Utilize the Page Load Functions of Svelte and Fetch API to dynamically request data from external files within the Static Folder.",
        "Use Tailwind to create custom styling rules and quickly develop in a mobile first manner."
      ],
      "outcome": "The Website successfully loads with promising optimizations used from the report generated by Lighthouse. The Site allows visitors to access recorded Courses, Events and Projects and dynamically fetch the data at run-time only."
    }
  ]
  